package com.siwuxie095.forme.designpattern.category.chapter13th.example4th;

/**
 * @author Jiajing Li
 * @date 2019-11-10 16:55:40
 */
public class Main {

    /**
     * 使用模式的心智
     *
     * （1）初学者的心智："我要为 Hello World 找个模式"
     * 初学者到处使用模式。这很好：初学者可以借此培养许多使用模式的实战经验。初学者
     * 也认为 "我使用越多模式，我的设计就越好"。初学者将慢慢认识到并非如此，所有的
     * 设计都应该尽量保持简单。只有在需要实践扩展的地方，才值得使用复杂性和模式。
     *
     * （2）中级人员的心智："或许这里我需要一个单例模式"
     * 随着学习的进程，中级人员的心智开始能够分辨何时需要模式，而何时不需要。中级人
     * 员的心智依然会企图把过多的模式套用在不适当的地方，但他们也开始察觉到有些模式
     * 并不适合目前的情况，可以对其改编使其适合。
     *
     * （3）悟道者的心智："在这里采用装饰者模式相当自然"
     * 悟道者的心智能够看到模式在何处能够自然融入。悟道者的心智并不急切于使用模式，
     * 而是致力于最能解决问题的简单方案。悟道者的心智会考虑对象的原则，以及它们之
     * 间的折衷。当对模式的需要自然出现时，悟道者的心智就会拿捏着采用模式。
     * 悟道者的心智也能看到相似模式之间的关系，以及它们在意图上的微妙差异。悟道者
     * 的心智也同于初学者的心智 --- 不会让这些模式的知识过度影响设计的决策。
     *
     *
     * 警告：过度使用设计模式可能导致代码被过度工程化。应该总是用最简单的解决方案
     * 完成工作，并在真正需要模式的地方才使用它。
     *
     * 注意：不是不希望你使用设计模式，而是更希望你能够成为一个好的面对对象设计者。
     * 当一个设计方案绝对要使用某个模式的时候，将为你带来好处，因为任何模式都是身
     * 经百战，被验证了是能够解决其问题的。而且模式可以被良好地归档，容易被其他开
     * 发人员所了解（因为模式是开发人员共享的词汇）。
     * 然而当你使用设计模式的时候，仍然会有缺点。设计模式常常产生一些额外的类和对
     * 象，所以会增加设计的复杂度。设计模式也会在你的设计中加入更多层，这不但增加
     * 复杂性，而且效率下降。
     * 另外，有时使用设计模式会大材小用。许多时候回头看看设计原则，你会发现有简单
     * 得多的解决方案能解决相同的问题。若果真如此，可别抗拒，就用较简单的解决方案
     * 吧。
     * 再次强调，这里并非鼓励你不要用设计模式，当设计模式应用得恰当时，好处是非常
     * 多的。
     *
     *
     * 别忘了共享词汇的威力
     *
     * 设计模式不仅可以帮助你在大脑中装进这些解决方案，也可以让你和其他开发人员之
     * 间有共享的词汇，而这正是设计模式最大的优点之一。
     *
     *
     * 共享词汇的五种方式
     *
     * （1）在设计会议中
     * 当你和你的团队在会议中讨论软件设计时，使用设计模式可以帮你们待在 "设计中"
     * 久一点。从设计模式和面向对象原则的视角讨论设计，可以避免你的团队很快地陷入
     * 实现的细节，也可以避免发生许多误解。
     *
     * （2）和其他开发人员
     * 当你和其他开发人员讨论的时候，可以使用模式。这可以帮助其他开发人员学习新模
     * 式，并建立一个社群。和别人分享你所学会的东西是很有成就感的一件事情。
     *
     * （3）在架构文档中
     * 当你编写架构文档的时候，使用模式将会缩减文档的篇幅，并且让读者更清楚地了解
     * 你的设计。
     *
     * （4）在代码注释以及命名习惯上
     * 当你在编写代码的时候，应在注释中清楚地注明你所使用的模式。在选择类和方法的
     * 名称时，应尽可能显示出隐藏在下面的模式。其他的开发人员在阅读你的代码时会感
     * 激你，因为你让他们能够很快地了解你的实现。
     *
     * （5）将志同道合的开发人员集合在一起
     * 分享你的知识。许多开发人员都听说过模式，但并不真正了解什么模式。你可以自愿
     * 为他们讲一堂模式介绍课，或者成立一个读书会。
     */
    public static void main(String[] args) {

    }

}
