package com.siwuxie095.forme.designpattern.category.chapter13th.example5th;

/**
 * @author Jiajing Li
 * @date 2019-11-10 17:28:26
 */
public class Main {

    /**
     * 模式动物园
     *
     * 模式并非从软件开始，而是始于建筑和城镇的架构。事实上，模式的概念可以
     * 被应用在许多不同的领域。
     *
     * （1）架构模式：
     * 用来建立生气勃勃的建筑、城镇和城市的架构。这也正是模式开始的地方。
     *
     * （2）应用模式：
     * 是建立系统级架构的模式。许多多层的架构都属于这一类目，如 MVC。
     *
     * （3）领域特定模式：
     * 关注特定领域的问题，例如并发系统或实时系统。
     *
     * （4）业务流程模式：
     * 描述业务、顾客和数据之间的交互，此种模式能够处理如 "如何有效决策并沟
     * 通决策" 之类的问题。
     *
     * （5）组织模式：
     * 描述了人类组织的结构以及实现。到目前为止大多数努力聚焦于制造或支持软
     * 件的组织。
     *
     * （6）用户界面设计模式：
     * 致力于解决设计交互式软件时的问题。
     */
    public static void main(String[] args) {

    }

}
